#+TITLE: Dotfiles Everywhere
#+AUTHOR: Anton Håkansson
#+BABEL: :cache yes
#+PROPERTY: header-args :mkdirp yes

* Colors
# Based off: https://raw.githubusercontent.com/bigardone/emacs-doom-theme/master/doom-one-theme.el

#+NAME: colors
| Name                   | GUI       | TERMINAL  |
|------------------------+-----------+-----------|
| bg                     | "#282c34" | nil       |
| bg-alt                 | "#21242b" | nil       |
| fg                     | "#bbc2cf" | "#bfbfbf" |
| fg-alt                 | "#5B6268" | "#2d2d2d" |
| grey                   | "#3f444a" | "#3f3f3f" |
| red                    | "#ff6c6b" | "#ff6655" |
| orange                 | "#da8548" | "#dd8844" |
| green                  | "#98be65" | "#99bb66" |
| teal                   | "#4db5bd" | "#44b9b1" |
| yellow                 | "#ECBE7B" | "#ECBE7B" |
| blue                   | "#51afef" | "#51afef" |
| dark-blue              | "#2257A0" | "#2257A0" |
| magenta                | "#c678dd" | "#c678dd" |
| violet                 | "#a9a1e1" | "#a9a1e1" |
| cyan                   | "#46D9FF" | "#46D9FF" |
| dark-cyan              | "#5699AF" | "#5699AF" |
| black                  | "#1B2229" | "#000000" |
| white                  | "#DFDFDF" | "#dfdfdf" |
| base0                  | "#1B2229" | "#000000" |
| base1                  | "#1c1f24" | "#1e1e1e" |
| base2                  | "#202328" | "#2e2e2e" |
| base3                  | "#23272e" | "#262626" |
| base4                  | "#3f444a" | "#3f3f3f" |
| base5                  | "#5B6268" | "#525252" |
| base6                  | "#73797e" | "#6b6b6b" |
| base7                  | "#9ca0a4" | "#979797" |
| base8                  | "#DFDFDF" | "#dfdfdf" |
| highlight              | "#51afef" | "#51afef" |
| vertical-bar           | "#191b20" | "#1b1b1b" |
| selection              | "#2257A0" | "#2257A0" |
| builtin                | "#c678dd" | "#c678dd" |
| comments               | "#5B6268" | "#525252" |
| doc-comments           | "#83898d" | "#7d7d7d" |
| constants              | "#a9a1e1" | "#a9a1e1" |
| functions              | "#c678dd" | "#c678dd" |
| keywords               | "#51afef" | "#51afef" |
| methods                | "#46D9FF" | "#46D9FF" |
| operators              | "#51afef" | "#51afef" |
| type                   | "#ECBE7B" | "#ECBE7B" |
| strings                | "#98be65" | "#99bb66" |
| variables              | "#dcaeea" | "#dcaeea" |
| numbers                | "#da8548" | "#dd8844" |
| region                 | "#42444a" | "#6c6c6c" |
| error                  | "#ff6c6b" | "#ff6655" |
| warning                | "#ECBE7B" | "#ECBE7B" |
| success                | "#98be65" | "#99bb66" |
| vc-modified            | "#da8548" | "#dd8844" |
| vc-added               | "#98be65" | "#99bb66" |
| vc-deleted             | "#ff6c6b" | "#ff6655" |
| hidden                 | "#282c34" | "black"   |
| modeline-fg            | "#bbc2cf" | "#bfbfbf" |
| modeline-fg-alt        | "#5B6268" | "#525252" |
| modeline-bg            | "#1c1e24" | "black"   |
| modeline-bg-l          | "#1d2026" | "black"   |
| modeline-bg-inactive   | "#1d2026" | nil       |
| modeline-bg-inactive-l | "#21242b" | "#1e1e1e" |

#+NAME: color
#+begin_src elisp :var c="bg" lookup-colors=colors
(map-some (lambda (k v) (if (equal k c) (car v))) lookup-colors)
#+end_src

#+RESULTS: color
: #282c34

#+NAME: lighten
#+begin_src elisp :var c="bg" lookup-colors=colors :noweb yes
(doom-lighten <<color>> 0.1)
#+end_src

#+RESULTS: lighten
: #3d4148

#+NAME: darken
#+begin_src elisp :var c="bg" lookup-colors=colors :noweb yes
(doom-darken <<color>> 0.1)
#+end_src

#+RESULTS: darken
: #24272e

